---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutGenError
source: html/354fb334-8651-73ba-b70e-029392b1e5dd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutGenError Property

Can't cut instance(s) of [Symbol] out of its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutInstanceOutGenError { get; }
```